Autodesk.Revit.DB.PolymeshTopology.GetNormals
Returns all normals assigned to the polymesh
Returns:
An array of XYZ values, each representing a normal vector
Since:
2014

Autodesk.Revit.DB.PolymeshTopology.GetNormal(System.Int32)
Returns a normal vector at the given index
idx:
A zero-based index
Returns:
XYZ value representing a normal vector
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value is not a valid index of a normal of the polymesh.
A valid valure is not negative and is smaller than the number of normals in the polymesh.
Since:
2014

Autodesk.Revit.DB.PolymeshTopology.GetUVs
Returns all UV coordinates assigned to the polymesh
Returns:
An array of UV coordinates
Since:
2014

Autodesk.Revit.DB.PolymeshTopology.GetUV(System.Int32)
Returns one UV coordinate at the given index.
idx:
A zero-based index of a UV coordinate
Returns:
UV coordinates at the given index
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value is not a valid index of a UV coordinate of the polymesh.
A valid valure is not negative and is smaller than the number of UV coordinates in the polymesh.
Since:
2014

Autodesk.Revit.DB.PolymeshTopology.GetPoints
Returns all points of the polymesh.
Returns:
An array of XYZ coordinates
Since:
2014

Autodesk.Revit.DB.PolymeshTopology.GetPoint(System.Int32)
Returns one point at the given index.
idx:
A zero-based index of a polymesh point
Returns:
XYZ coordinates of the point
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value is not a valid index of a point of the polymesh.
A valid valure is not negative and is smaller than the number of points in the polymesh.
Since:
2014

Autodesk.Revit.DB.PolymeshTopology.GetFacets
Returns a definitions of all facets of the polymesh
Returns:
An array of PolymeshFacet instances, each of which represents
one facet defined by 3 vertices of the polymesh.
Since:
2014

Autodesk.Revit.DB.PolymeshTopology.GetFacet(System.Int32)
Returns a definition of one facet
idx:
A zero-based index of the facet
Returns:
An instance of PolymeshFacet that represents
one facet defined by 3 vertices of the polymesh.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value is not a valid index of a facet of the polymesh.
A valid value is not negative and is smaller than the number of facets in the polymesh.
Since:
2014

Autodesk.Revit.DB.PolymeshTopology.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PolymeshTopology.NumberOfUVs
The number of UV coordinates available for the polymesh.
Remarks:
Normally, the number of UV coordinates corresponds to the number of points in a polymesh,
but a polymesh does not have to have UVs assigned, in which case the value of this property is 0.
Since:
2014

Autodesk.Revit.DB.PolymeshTopology.NumberOfNormals
The number of normals associated with the polymesh
Remarks:
The number is always equal either to '1', or the number of facets,
or the number of points. The DistributionOfNormals property indicates
how normals are distributed along the polymesh. If there is only one normal available,
it applies to the entire mesh. Curved surfaces have normal vectors associated
with either every facet or every point/vertex of the tessellated  polymesh.
Since:
2014

Autodesk.Revit.DB.PolymeshTopology.NumberOfPoints
The number of points in the polymesh
Since:
2014

Autodesk.Revit.DB.PolymeshTopology.NumberOfFacets
The number of facet in the polymesh.
Since:
2014

Autodesk.Revit.DB.PolymeshTopology.DistributionOfNormals
Indicates the distribution of normal vectors along the tessellated polymesh surface.
Since:
2014

Autodesk.Revit.DB.PolymeshTopology
A class representing topology of a polymesh.
Remarks:
Topology of a polymesh consists of a number of points and triangular facets formed
by the points. Each facet is determined by three indices to the array of points.
A polymesh may have UV coordinates assigned, and always has at least one normal associated.
There may be more than one normal available for a non-planar polymesh; there may be as many
normals as there are either facets or points in the polymesh. The DistributionOfNormals
property indicates how normals are distributed along the polymesh.
Since:
2014